#define _CRT_SECURE_NO_WARNINGS 1
#include<stdio.h>

//int check_sys()
//{
//	int a = 1;
//	return *((char*)&a);
//}
//int main()
//{
//	int ret = check_sys();
//	if (ret)
//	{
//		printf("小端\n");
//	}
//	else
//	{
//		printf("大端\n");
//	}
//
//	return 0;
//}


//int main()
//{
//	char a = -1;
//	//10000001  原码
//	//11111110  反码
//	//11111111  补码 （存储）
//	//10000001  原码 （打印）
//	signed char b = -1;
//	//10000001
//	//11111110
//	//11111111  
//	//10000001
//	//同上
//	unsigned char c = -1;
//	//10000001
//	//11111110
//	//11111111 补码 存储、打印
//	//因为无符号所有原返补相同（以存储的补码来看）
//	printf("a=%d\tb=%d\tc=%d\t\n", a, b, c);
//
//
//	return 0;
//}

//#include<stdio.h>
//int main()
//{
//	char a = -128;
//	
//	//10000000000000000000000010000000
//	//11111111111111111111111101111111
//	//11111111111111111111111110000000
//	// 10000000
//	//%u以无符号的形式打印整形
//	//整形提升：（因为前面是负所有补一，正补零）
//	//11111111111111111111111110000000
//	//因为以无符号打印，原返补相同所有打印42亿+
//	printf("%u", a);
//
//	return 0;
//}


//#include<Stdio.h>
//int main()
//{
//	char a=128;
//	//00000000000000000000000010000000
//	//10000000-- -a
//	//整形提升（因为前面是负所有补一，正补零）
//	//11111111111111111111111110000000
//	//因为以无符号打印，原返补相同所有打印42亿+
//	printf("%u", a);
//
//	return 0;
//}

//int main()
//{
//	int i = -20;
//	unsigned int j = 10;
//
//	printf("%d\n", i + j);//打印-10
//
//	return 0;
//}

//int main()
//{
//	unsigned int n = -10;
//	int m = -10;
//	//10000000000000000000000000001010
//	//11111111111111111111111111110101
//	//11111111111111111111111111110110 补码
//	//因为n的本身是无符号整形所以存的是：
//	//11111111111111111111111111110110 补码
//	// 又以有符号打印，需要把补码变成原码
//	
//	//10000000000000000000000000001010 原码
//	printf("%d\n", n);
//	printf("%d\n", m);
//	//因为n的本身是无符号整形所以存的是：
//	//11111111111111111111111111110110 补码
//	//又以无符号打印，原反补相同：
//	//11111111111111111111111111110110 原码
//	printf("%u\n", n);
//	printf("%u\n", m);
//	return 0;
//}


//#include<windows.h>
//int main()
//{
//	unsigned int i;
//	for (i = 9; i >= 0; i--)
//	{
//		printf("%u\n", i);//会死循环
//		Sleep(1000);
//	}
//
//	return 0;
//}

//#include<stdio.h>
//#include<string.h>
//int main()
//{
//	char a[1000];//-128- -127
//	int i;
//	for (i = 0; i < 1000; i++)
//	{
//		a[i] = -1 - i;
//	}
//	printf("%d", strlen(a));
//	return 0;
//}

