#define _CRT_SECURE_NO_WARNINGS 1
#include<stdio.h>

int main()

{
    int a, b, max = 0;
    printf("输入：");
    scanf("%d %d", &a, &b);
    max = a > b ? a : b;
    printf("输出较大值%d", max);

    return 0;

}
                               /***运算符****/

/*“/”和“%”运算符的运用*/
//int main()
//{
//	int a = 7 / 2;
//	int b = 7 % 2;//取模/余
//	float c = 7 / 2.0;	
//	printf("%d\n", a);
//	printf("%d\n", b);
//	printf("%f\n", c);
//
//	return 0;
//}


/*">>"右移和"<<"左移运算符*/
//int main()
//{
//	int a = 12;
//	a = a >> 1;//1.把a中的12转换成二进制......1100
//             //2.然后把二进制数右移一位......0110  
//	printf("%d\n", a);//输出整数6
//
//	return 0;
//
//}

/*"~"取反运算符的运用*/
/*注意：计算机识别的二进制
        整数存放在内存中也存放的是二进制
        整数的二进制怎么表示？
        整数的二进制表示方式有3种：
        原码-直接按照数字的正负转换成二进制数就是原码
        反码-原码的符号位不变，其他位按位取反，就是反码
        补码-反码加1，就是补码*/

/*
  正整数的原码、反码、补码都相同。
  负整数的原码、反码、补码要计算。
 */
/*规定：对于有符号整数，二进制的最高位是符号
        最高位是0，表示正数
        最高位是1，表示负数
 */

//int main()
//{
    /*int a = 0;//int在x86是32bit
    //00000000000000000000000000000000--原码
    //00000000000000000000000000000000--反码
    //00000000000000000000000000000000--补码
   
    int b = -1;
    //10000000000000000000000000000001--原码
    //11111111111111111111111111111110--反码
    //11111111111111111111111111111111--补码
    */
   
/*内存中以补码的形式存储*/
//    int a = 0;
//    //00000000000000000000000000000000--补码（正数原反补一样）
//    //  
//    //11111111111111111111111111111111--~a补码
//    //11111111111111111111111111111110--反码（之前的加1补码，变减1反码）
//    //10000000000000000000000000000001--原码
//    int b = 5;
//    //00000000000000000000000000000101 -补码
//   
//    //11111111111111111111111111111010 - ~b补码
//    //11111111111111111111111111111001 - 反码 
//    //10000000000000000000000000000110 - 原码 （-6）
//    int c = -1;
//    //10000000000000000000000000000001 - 原码
//    //11111111111111111111111111111110 - 反码
//    //11111111111111111111111111111111 - 补码
//    
//    //00000000000000000000000000000000 - ~ -1 的补码 （原码，反码，补码一同） - 0
//    
//
//    printf("%d\n", ~a);
//    printf("%d\n", ~b);
//    printf("%d\n", ~c);
//    
//    return 0;
//
//}

/*前后"++""--"*/
//int main()
//{
//    int a = 10;
//    int b = a++;//后++ 先用再加，a的值先赋给b，b=10。之后再a加1，a的值为11。
//    int c = 5;
//    int d = ++c;//前++ 先加再用，c的值先加1，c=6。之后再赋值给d，d的值为6。
//    printf("a=%d,b=%d\n", a, b);
//    printf("c=%d,d=%d\n", c, d);
//    return 0;
//}


/*"&&"逻辑与和"||"逻辑或"!"逻辑非*/
//int main() 
//{
//    int a;
//    int b;
//    scanf("a=%d,b=%d", &a, &b);
//    if (a && b == 1)printf("ab都是不为零的数。\n");
//    if (a || b == 1)printf(".。。");
//
//    return 0;
//
//}

